In [3]:
#groupby
#merge
#concate
#append

import pandas as pd

In [4]:
df=pd.read_csv(r'C:\Users\saura\Downloads\titanic_data.csv')

In [5]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [6]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
 2   Pclass       418 non-null    int64
 3   Name         418 non-null    object
 4   Sex          418 non-null    object
 5   Age          332 non-null    float64
 6   SibSp        418 non-null    int64
 7   Parch        418 non-null    int64
 8   Ticket       418 non-null    object
 9   Fare         417 non-null    float64
 10  Cabin        91 non-null     object
 11  Embarked     418 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 39.3+ KB

In [8]:
df.Pclass.unique()

array([3, 2, 1], dtype=int64)

In [10]:
df.Embarked.sum()

'QSQSSSQSCSSSSSSCQCSCCSSCCSCCSCSSSSCCSSSSCSSSSSCQCSSCSSCQSSSCSSSQCSQSCSQSSCCCSSSQCSSSQCQSQSSSSSCSSSSSCSQSCSQQSSCQCQSCCSCSSQCSQSSQSSSCSCSSCSSSSSCSSSSSSSCCSSSSSSSSQCSSSSCSCSSCSCSSSCSCSCSQCSSSSSSSSQSSCSSSQSCSSCQSCSSSSSSSQSCSCSSSCCSQSSSSSQCSCCSCCSCSSSSSSCSSCSSSQSSSSSSSCSSSSSCQCQCSSSSSSSQCSSSSCSSQCSSSCCSSSCSSQSSSSSSCSQCQCSSSSCSSSSSCSSSCCCSSSCSCSSSCSSSCSSCSSSSSSSQSSCSSCSCSCCSCSSSCSSSSQQSSSSSSQSSSSSSSQCSQSSCSCCSCQSQQSSCSSC'

In [19]:
#groupby method

df.groupby(['Pclass'])['Sex'].sum()

Pclass
1    malefemalefemalemalefemalemalefemalefemalemale...
2    malemalemalefemalemalemalemalefemalemalefemale...
3    malefemalemalefemalemalefemalefemalemalemalema...
Name: Sex, dtype: object

In [21]:
df.groupby(['Pclass'])['Survived'].sum()

Pclass
1    50
2    30
3    72
Name: Survived, dtype: int64

In [31]:
#task 1--try to determine the total number of person survived.

no_of_survived_person=df.Survived.sum()

In [32]:
no_of_survived_person

152

In [43]:
#task2--try to determine the total number of person who are not able to survived

total_data=df.shape[0]

In [44]:
total_data

418

In [45]:
no_of_unsurvived_person=total_data-no_of_survived_person

In [46]:
no_of_unsurvived_person

266

In [48]:
#task3--try to get the percentage of survived vs unsurvived passengers in titanic data set

per_of_survived=(no_of_survived_person/total_data)*100

In [49]:
per_of_survived

36.36363636363637

In [50]:
per_of_unsurvived_person=(no_of_unsurvived_person/total_data)*100

In [51]:
per_of_unsurvived_person

63.63636363636363

In [52]:
#coments----
# in titanic 36% person who were able to survived and 64% person who were not able to survived

In [ ]:
#task----find percentage fare of survived and unsurvived person

In [54]:
df.groupby(['Pclass'])[['Survived','Fare']].sum()

        Survived        Fare
Pclass
1             50  10087.9918
2             30   2064.7957
3             72   2703.7501

In [62]:
total_exp=df.Fare.sum()

In [79]:
total_exp

14856.5376

In [67]:
exp_by_survive_person=df.loc[df['Survived']>0]['Fare'].sum()

In [68]:
exp_by_survive_person

7561.6502

In [72]:
exp_by_unsurvive_person=df.loc[df['Survived']<1]['Fare'].sum()

In [73]:
exp_by_unsurvive_person

7294.8874000000005

In [75]:
per_of_survive_person_fare=(exp_by_survive_person/total_exp)*100

In [76]:
per_of_survive_person_fare

50.89779599790465

In [77]:
per_of_unsurvive_person_fare=(exp_by_unsurvive_person/total_exp)*100

In [78]:
per_of_unsurvive_person_fare

49.10220400209535

In [80]:
# coments--
# exp by survived person is 51% and exp by who were not able to survive is 49%